[
  {
    "id": 1,
    "title": "EduMaster: Learn Smartly",
    "companyName": "Learnify Ltd",
    "description": "EduMaster is the ultimate all-in-one learning platform meticulously designed for students across **grades 6 through 12**. This comprehensive application provides an expansive suite of educational tools and resources, making it a central hub for academic success. Users can access structured lesson plans, interactive modules, and up-to-date study materials tailored to their specific curriculum. The platform focuses on promoting \"smart learning\" by integrating personalized progress tracking and adaptive testing features to identify knowledge gaps and recommend targeted practice. With a robust rating of **4.5** from 1200 reviews and over **50,000 downloads**, EduMaster proves to be a reliable and highly-rated tool for enhancing understanding and boosting performance in various subjects. It's the intelligent way to manage your studies and excel in school.",
    "size": 42,
    "reviews": 1200,
    "ratingAvg": 4.5,
    "downloads": 50000,
    "image": "https://i.pinimg.com/736x/82/0a/c2/820ac270bcd827451e2dc82e7d583997.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 50
      },
      {
        "name": "2 star",
        "count": 80
      },
      {
        "name": "3 star",
        "count": 180
      },
      {
        "name": "4 star",
        "count": 350
      },
      {
        "name": "5 star",
        "count": 540
      }
    ]
  },
  {
    "id": 2,
    "title": "QuizZone: Learn by Playing",
    "companyName": "BrightTech",
    "description": "QuizZone offers an engaging and highly interactive approach to learning by transforming study sessions into a fun, competitive experience. This dynamic app features **thousands of practice questions** across multiple academic disciplines, allowing students to solidify their knowledge and prepare for exams in an enjoyable way. Users can participate in quizzes, track their scores, and challenge themselves with varied question formats to ensure comprehensive understanding of key concepts. The app's design emphasizes the gamification of education, making regular practice less of a chore and more of a stimulating activity. With **120,000 downloads** and an average rating of **4.2** across 2100 reviews, QuizZone is a popular choice for students looking to learn effectively through play, offering a fresh, motivation-boosting alternative to traditional studying.",
    "size": 38,
    "reviews": 2100,
    "ratingAvg": 4.2,
    "downloads": 120000,
    "image": "https://i.pinimg.com/736x/e6/e1/0a/e6e10ab2e3c9398b286c16f6d5c3ec86.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 120
      },
      {
        "name": "2 star",
        "count": 160
      },
      {
        "name": "3 star",
        "count": 380
      },
      {
        "name": "4 star",
        "count": 700
      },
      {
        "name": "5 star",
        "count": 740
      }
    ]
  },
  {
    "id": 3,
    "title": "SmartSheets: Data Manager",
    "companyName": "DataLogic",
    "description": "SmartSheets is an essential data management application specifically developed for the academic sector, enabling users to **manage and analyze academic data seamlessly**. This powerful tool simplifies complex tasks such as tracking student progress, managing institutional records, and generating insightful performance reports. Its intuitive interface allows educators and administrators to input, organize, and visualize large datasets with ease, significantly reducing administrative overhead and ensuring data accuracy. The app's core value lies in transforming raw data into actionable intelligence, helping stakeholders make informed decisions about curriculum planning and student support. Achieving a high average rating of **4.6** from 980 reviews and accumulating **75,000 downloads**, SmartSheets is recognized for its reliability and efficiency in streamlining data operations within any educational environment.",
    "size": 55,
    "reviews": 980,
    "ratingAvg": 4.6,
    "downloads": 75000,
    "image": "https://i.pinimg.com/736x/64/cf/d8/64cfd84cfdf435da48f69c733a425d90.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 30
      },
      {
        "name": "2 star",
        "count": 40
      },
      {
        "name": "3 star",
        "count": 90
      },
      {
        "name": "4 star",
        "count": 290
      },
      {
        "name": "5 star",
        "count": 530
      }
    ]
  },
  {
    "id": 4,
    "title": "BookHive: Study Library",
    "companyName": "Eduverse Labs",
    "description": "BookHive serves as a vital digital resource, functioning as an extensive **digital book library for academic and admission test materials**. This platform provides students with instant, on-demand access to a vast collection of e-books, textbooks, reference guides, and specialized preparation materials for competitive exams. The convenience of having a comprehensive library in a single app means users can study anytime and anywhere without needing physical books. It’s an invaluable tool for dedicated learners focused on both their regular coursework and high-stakes admission tests. While its download count is **32,000** and it has 430 reviews, the app maintains a respectable **4.1** average rating, demonstrating its utility as a portable and accessible source of crucial study information. BookHive is committed to making necessary academic content readily available to every student.",
    "size": 60,
    "reviews": 430,
    "ratingAvg": 4.1,
    "downloads": 32000,
    "image": "https://i.pinimg.com/736x/ce/d3/6e/ced36e35d39a3cb3199c58bfbf382b53.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 25
      },
      {
        "name": "2 star",
        "count": 45
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 140
      },
      {
        "name": "5 star",
        "count": 100
      }
    ]
  },
  {
    "id": 5,
    "title": "TestLab: Exam Practice",
    "companyName": "ExamPro Inc.",
    "description": "TestLab is an advanced learning application centered on **AI-based exam practice and performance analysis**. Leveraging cutting-edge artificial intelligence, the app creates highly personalized practice test environments that closely mimic real examination conditions. The AI not only generates a wide variety of relevant test questions but also meticulously analyzes a user's performance, providing detailed feedback on strengths, weaknesses, and areas needing further focus. This deep analytical capability helps students refine their study strategies for maximum impact. With a large user base reflected by **150,000 downloads** and **1600 reviews**, TestLab has earned an exceptional average rating of **4.7**, positioning it as one of the most effective and highly-rated tools for serious exam preparation and achieving peak academic performance.",
    "size": 48,
    "reviews": 1600,
    "ratingAvg": 4.7,
    "downloads": 150000,
    "image": "https://i.pinimg.com/736x/ba/04/4e/ba044ea29f6b2b849669d68069f6b606.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 60
      },
      {
        "name": "2 star",
        "count": 80
      },
      {
        "name": "3 star",
        "count": 180
      },
      {
        "name": "4 star",
        "count": 450
      },
      {
        "name": "5 star",
        "count": 830
      }
    ]
  },
  {
    "id": 6,
    "title": "LangPro: Learn Languages",
    "companyName": "SoftNova",
    "description": "LangPro offers a versatile and effective method to **learn English, Bangla, and more through smart exercises**. This language-learning application is designed to cater to diverse linguistic goals, whether a user seeks to master a new tongue for academic purposes, professional growth, or personal enrichment. The platform employs a variety of innovative, interactive exercises—including speaking practice, comprehension tasks, and vocabulary builders—to ensure holistic language acquisition. The structured curriculum progresses logically, building a strong foundation in grammar, vocabulary, and practical communication skills. Supported by **68,000 downloads** and 900 reviews, LangPro has a solid average rating of **4.3**, making it a well-regarded app for anyone committed to expanding their language repertoire. It makes the journey of becoming multilingual both rewarding and convenient.",
    "size": 40,
    "reviews": 900,
    "ratingAvg": 4.3,
    "downloads": 68000,
    "image": "https://i.pinimg.com/1200x/0f/5b/9e/0f5b9ef506f44eb04c59bd1a731f93ff.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 60
      },
      {
        "name": "2 star",
        "count": 90
      },
      {
        "name": "3 star",
        "count": 140
      },
      {
        "name": "4 star",
        "count": 250
      },
      {
        "name": "5 star",
        "count": 360
      }
    ]
  },
  {
    "id": 7,
    "title": "Mathify: Solve Smartly",
    "companyName": "Udvash Tech",
    "description": "Mathify is a premier smart math learning app that incorporates advanced technology for effective problem-solving. It offers a revolutionary approach to tackling complex mathematical challenges with its **step-by-step AI problem solving** feature. Users can input problems and receive detailed, easy-to-follow explanations that break down the solution process, fostering true conceptual understanding rather than just providing the final answer. The app covers a vast range of topics, catering to various student levels and academic needs. Its remarkable success is evident with an impressive **210,000 downloads**, 2300 reviews, and a near-perfect average rating of **4.8**. Mathify stands out as a top-tier educational tool, making intricate mathematical concepts accessible and helping students master problem-solving skills with clarity and confidence.",
    "size": 52,
    "reviews": 2300,
    "ratingAvg": 4.8,
    "downloads": 210000,
    "image": "https://i.pinimg.com/1200x/f9/20/cb/f920cbb92324066652ef40bc61a300c6.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 70
      },
      {
        "name": "2 star",
        "count": 90
      },
      {
        "name": "3 star",
        "count": 180
      },
      {
        "name": "4 star",
        "count": 520
      },
      {
        "name": "5 star",
        "count": 1440
      }
    ]
  },
  {
    "id": 8,
    "title": "ResultXpress: Quick Results",
    "companyName": "EduSoft BD",
    "description": "ResultXpress is a highly efficient and indispensable tool for schools and institutions, offering an **automated student result publication and analysis platform**. It drastically simplifies the often-complex and time-consuming process of compiling, publishing, and disseminating academic results. Beyond mere publication, the app offers robust analytical capabilities, allowing educators and parents to generate reports that track student performance trends over time, identify areas of underperformance, and measure the effectiveness of teaching strategies. With **95,000 downloads** and 780 reviews, ResultXpress maintains a strong average rating of **4.4**, indicating its reliability and the value it provides in educational administration. It is the go-to solution for delivering quick, accurate, and insightful academic results with minimal manual effort.",
    "size": 44,
    "reviews": 780,
    "ratingAvg": 4.4,
    "downloads": 95000,
    "image": "https://i.pinimg.com/736x/cf/5d/c9/cf5dc924ac7b574eb23d8847b44695ce.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 35
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 210
      },
      {
        "name": "5 star",
        "count": 355
      }
    ]
  },
  {
    "id": 9,
    "title": "VisionLearn: See Concepts",
    "companyName": "AI SmartLabs",
    "description": "VisionLearn is an innovative educational application dedicated to **visual-based concept learning for science and technology**. The app revolutionizes how complex scientific and technological ideas are understood by using rich, interactive visual aids, simulations, 3D models, and animations. By focusing on visual comprehension, VisionLearn caters to different learning styles, making abstract concepts concrete and easier to grasp. This approach is particularly effective for subjects that benefit from seeing the underlying mechanics in action. The app is a popular resource, having reached **130,000 downloads** and receiving 1450 reviews, with an excellent average rating of **4.6**. VisionLearn is committed to demystifying difficult subjects and making high-level academic content accessible and engaging through the power of visual learning technology.",
    "size": 58,
    "reviews": 1450,
    "ratingAvg": 4.6,
    "downloads": 130000,
    "image": "https://i.pinimg.com/1200x/8e/85/7b/8e857b1a0c1b764253023a1b72fe4a50.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 55
      },
      {
        "name": "2 star",
        "count": 80
      },
      {
        "name": "3 star",
        "count": 180
      },
      {
        "name": "4 star",
        "count": 410
      },
      {
        "name": "5 star",
        "count": 725
      }
    ]
  },
  {
    "id": 10,
    "title": "NoteCraft: Smart Notes",
    "companyName": "ThinkSoft",
    "description": "NoteCraft is the modern solution for academic organization, designed to help students and educators **create, organize, and share academic notes effortlessly**. This powerful note-taking app moves beyond basic text entry, incorporating smart features like multimedia integration, dynamic tagging, and cloud synchronization for easy access across devices. Users can structure their study materials logically, making review and retrieval simple and efficient. The built-in sharing features also promote collaborative learning among peers and ease the distribution of lecture materials by teachers. With **40,000 downloads** and 600 reviews, NoteCraft is rated at a solid **4.0**. It serves as an essential digital utility for keeping academic life streamlined, ensuring that all valuable information is captured, organized, and available when it's needed most for studying or teaching.",
    "size": 36,
    "reviews": 600,
    "ratingAvg": 4.0,
    "downloads": 40000,
    "image": "https://i.pinimg.com/1200x/19/ce/78/19ce78573c1a739a998a7aff07ecd3eb.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 40
      },
      {
        "name": "2 star",
        "count": 70
      },
      {
        "name": "3 star",
        "count": 150
      },
      {
        "name": "4 star",
        "count": 180
      },
      {
        "name": "5 star",
        "count": 160
      }
    ]
  },
  {
    "id": 11,
    "title": "ExamVault: Secure Exams",
    "companyName": "EduCore",
    "description": "ExamVault is a specialized, high-security platform designed for **secure question paper and answer script management systems**. This application is vital for educational institutions that prioritize integrity and confidentiality in their examination process. It provides end-to-end security for creating, storing, distributing, and collecting sensitive exam documents, mitigating the risks associated with manual handling and paper-based systems. The platform features strict access controls, version tracking, and encryption to ensure that the examination process remains fair and uncompromised. With **87,000 downloads** and a strong average rating of **4.5** from 820 reviews, ExamVault is trusted by administrators seeking a reliable, digital solution to secure the lifecycle of all critical assessment materials. It is a modern solution for exam administration.",
    "size": 49,
    "reviews": 820,
    "ratingAvg": 4.5,
    "downloads": 87000,
    "image": "https://i.pinimg.com/1200x/af/62/d6/af62d642f9546f55a108d28d17c59ef8.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 40
      },
      {
        "name": "2 star",
        "count": 70
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 260
      },
      {
        "name": "5 star",
        "count": 330
      }
    ]
  },
  {
    "id": 12,
    "title": "SkillBoost: Build Skills",
    "companyName": "NextGen Learn",
    "description": "SkillBoost is a leading platform dedicated to professional development, offering a diverse array of **skill-building courses and certifications**. Unlike apps focused solely on academic curriculum, SkillBoost prepares individuals for the demands of the modern workforce by teaching practical, in-demand skills such as coding, data analysis, digital marketing, and project management. The platform features content created by industry experts, culminating in professional certifications that are recognized by employers. Its popularity is immense, evidenced by an outstanding **300,000 downloads** and 2100 reviews, earning it a high average rating of **4.7**. SkillBoost is the essential app for ambitious learners and professionals looking to continuously upskill, enhance their resume, and secure a competitive advantage in their careers through accredited, high-quality learning experiences.",
    "size": 61,
    "reviews": 2100,
    "ratingAvg": 4.7,
    "downloads": 300000,
    "image": "https://i.pinimg.com/1200x/4a/28/91/4a28917586006567d3219ba570b0a5f5.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 100
      },
      {
        "name": "2 star",
        "count": 130
      },
      {
        "name": "3 star",
        "count": 200
      },
      {
        "name": "4 star",
        "count": 520
      },
      {
        "name": "5 star",
        "count": 1150
      }
    ]
  },
  {
    "id": 13,
    "title": "ClassConnect: Smart Class",
    "companyName": "Udvash Systems",
    "description": "ClassConnect is a crucial administrative tool designed to streamline academic operations through its **smart class scheduling and attendance tracking platform**. This application automates the complex task of creating and managing class timetables, ensuring optimal resource allocation and avoiding scheduling conflicts. Furthermore, its advanced attendance tracking features allow teachers to quickly record and monitor student presence, providing real-time data to administrators and parents. This digital approach saves significant time, enhances accuracy, and improves communication regarding classroom logistics. With **98,000 downloads** and a solid average rating of **4.4** from 1150 reviews, ClassConnect is a reliable choice for educational institutions seeking to modernize and digitize their daily administrative workflows for better overall efficiency and operational transparency.",
    "size": 43,
    "reviews": 1150,
    "ratingAvg": 4.4,
    "downloads": 98000,
    "image": "https://i.pinimg.com/736x/7f/cf/6b/7fcf6b48d3a59392a1bdda6ab88888ed.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 50
      },
      {
        "name": "2 star",
        "count": 70
      },
      {
        "name": "3 star",
        "count": 160
      },
      {
        "name": "4 star",
        "count": 330
      },
      {
        "name": "5 star",
        "count": 540
      }
    ]
  },
  {
    "id": 14,
    "title": "AI Mentor: Study Helper",
    "companyName": "EduAI Hub",
    "description": "AI Mentor is the cutting-edge personal study assistant, providing a **personal AI tutor for solving academic doubts instantly**. Utilizing sophisticated artificial intelligence, the app offers immediate, 24/7 support across all major academic subjects. Students can pose complex questions, submit problems, or ask for concept clarifications and receive concise, human-quality explanations and step-by-step solutions instantly. This on-demand tutoring eliminates the wait time for teacher availability, fostering continuous learning and problem-solving momentum. Its exceptional performance is reflected in **220,000 downloads** and 1750 reviews, earning it an outstanding average rating of **4.8**. AI Mentor is transforming the way students study, ensuring they have expert guidance and instant help to overcome any academic roadblock and achieve their full potential.",
    "size": 59,
    "reviews": 1750,
    "ratingAvg": 4.8,
    "downloads": 220000,
    "image": "https://i.pinimg.com/1200x/bc/95/0f/bc950f331c0cba695c3e735d52aad82e.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 60
      },
      {
        "name": "2 star",
        "count": 70
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 400
      },
      {
        "name": "5 star",
        "count": 1100
      }
    ]
  },
  {
    "id": 15,
    "title": "EduTrack: Learn Progress",
    "companyName": "SmartLearn Co",
    "description": "EduTrack is an indispensable utility for goal-oriented students, designed to help users **track their learning progress across multiple subjects**. The app provides a clear, visual dashboard that aggregates performance data from assignments, tests, and study sessions, offering a holistic view of a student's academic journey. By setting personalized goals and monitoring daily and weekly activities, users can identify their most productive study patterns and manage their time more effectively. This systematic approach to self-assessment encourages accountability and continuous improvement. With **96,000 downloads** and 900 reviews, EduTrack maintains a respectable average rating of **4.4**, making it a well-regarded tool for students who want to take control of their education and ensure they are on the right path to meeting their academic objectives.",
    "size": 47,
    "reviews": 900,
    "ratingAvg": 4.4,
    "downloads": 96000,
    "image": "https://i.pinimg.com/1200x/f3/bd/3f/f3bd3f5abdf6437ea95473f12c3547b2.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 45
      },
      {
        "name": "2 star",
        "count": 65
      },
      {
        "name": "3 star",
        "count": 130
      },
      {
        "name": "4 star",
        "count": 280
      },
      {
        "name": "5 star",
        "count": 380
      }
    ]
  },
  {
    "id": 16,
    "title": "LearnFlow: Study Planner",
    "companyName": "BrightPath",
    "description": "LearnFlow is the essential organizational app for students, enabling them to **plan and manage their study schedules effectively**. The platform offers a highly customizable digital planner where users can break down large study goals into manageable daily and weekly tasks, allocate specific time blocks for subjects, and integrate deadlines for assignments and exams. By providing a structured framework, LearnFlow reduces procrastination and helps users maintain a balanced academic life. Its design focuses on simplicity and ease of use, ensuring that the planning process itself is not a distraction. With **70,000 downloads** and 670 reviews, the app holds a solid average rating of **4.3**, proving its value as a foundational tool for time management. LearnFlow is the key to creating focused, sustainable, and highly productive study routines.",
    "size": 41,
    "reviews": 670,
    "ratingAvg": 4.3,
    "downloads": 70000,
    "image": "https://i.pinimg.com/1200x/d6/17/8b/d6178b2910b048cd6d349cb411ca4808.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 40
      },
      {
        "name": "2 star",
        "count": 55
      },
      {
        "name": "3 star",
        "count": 110
      },
      {
        "name": "4 star",
        "count": 190
      },
      {
        "name": "5 star",
        "count": 275
      }
    ]
  },
  {
    "id": 17,
    "title": "TaskMate: Daily Tasks",
    "companyName": "SoftEdge",
    "description": "TaskMate is a straightforward and efficient task management application designed to help users **organize daily academic and work-related tasks**. The app serves as a digital checklist and reminder system, ensuring that no assignment, deadline, or appointment is overlooked. Its core functionality is centered on simplicity: users can quickly input tasks, assign priority levels, set due dates, and mark items as complete, fostering a sense of accomplishment and clarity. TaskMate is an excellent tool for anyone needing a simple, reliable system to maintain focus and productivity across their busy schedule. With **60,000 downloads** and 580 reviews, it maintains an average rating of **4.1**, highlighting its utility as a practical and dependable solution for daily academic and organizational needs.",
    "size": 39,
    "reviews": 580,
    "ratingAvg": 4.1,
    "downloads": 60000,
    "image": "https://i.pinimg.com/736x/7a/55/c3/7a55c3a67b0ce5ad794adb7d08b64a13.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 35
      },
      {
        "name": "2 star",
        "count": 50
      },
      {
        "name": "3 star",
        "count": 110
      },
      {
        "name": "4 star",
        "count": 170
      },
      {
        "name": "5 star",
        "count": 215
      }
    ]
  },
  {
    "id": 18,
    "title": "TeachEase: Tutor Tools",
    "companyName": "EduPro",
    "description": "TeachEase is a dedicated resource platform specifically crafted for educators, providing comprehensive **teaching tools for creating lessons and assessments**. This application significantly simplifies the preparation phase of teaching by offering templates for lesson plans, access to curated educational content, and intuitive features for generating various types of quizzes, exams, and projects. It empowers tutors to spend less time on administrative tasks and more time on high-quality instruction and student engagement. Its effectiveness is demonstrated by **124,000 downloads** and 1100 reviews, giving it an excellent average rating of **4.6**. TeachEase is the indispensable digital assistant for modern tutors and teachers, ensuring they have the best resources at their disposal to deliver effective, engaging, and well-organized learning experiences for their students.",
    "size": 57,
    "reviews": 1100,
    "ratingAvg": 4.6,
    "downloads": 124000,
    "image": "https://i.pinimg.com/1200x/3f/48/b4/3f48b445a3eb384d5111b9484db5a79d.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 45
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 130
      },
      {
        "name": "4 star",
        "count": 310
      },
      {
        "name": "5 star",
        "count": 555
      }
    ]
  },
  {
    "id": 19,
    "title": "ExamBoard: Test Maker",
    "companyName": "AssessTech",
    "description": "ExamBoard is an innovative platform for educators and institutions that allows users to **create and manage online tests efficiently**. This app revolutionizes the assessment process by offering a secure, feature-rich environment for designing, administering, and grading digital examinations. Users can select from various question types, randomize question order for security, and utilize automated grading features to instantly process results, saving vast amounts of time. The platform's ease of use and comprehensive analytics make it ideal for any educational setting. With **102,000 downloads** and 1000 reviews, ExamBoard has secured a strong average rating of **4.5**, making it a trusted and effective solution for modernizing and standardizing the critical task of academic assessment across any curriculum.",
    "size": 53,
    "reviews": 1000,
    "ratingAvg": 4.5,
    "downloads": 102000,
    "image": "https://i.pinimg.com/1200x/72/bf/96/72bf965a6c18b0d6da7b7d0ff8f1d9dc.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 40
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 140
      },
      {
        "name": "4 star",
        "count": 280
      },
      {
        "name": "5 star",
        "count": 480
      }
    ]
  },
  {
    "id": 20,
    "title": "EduCloud: Smart Storage",
    "companyName": "SkyLearn",
    "description": "EduCloud offers a specialized, secure, and intuitive **cloud-based storage solution for educational materials**. Designed specifically for the needs of students and teachers, it provides ample, accessible space for saving documents, presentations, videos, and large academic files. The platform features strong organizational tools, version control, and secure sharing capabilities, ensuring that all valuable resources are backed up and accessible from any device. This eliminates the risk of losing important study or teaching materials. With **89,000 downloads** and 850 reviews, EduCloud maintains a respectable average rating of **4.4**, making it a reliable, essential utility for academic life, offering peace of mind and the convenience of having all educational content safely stored and organized in one secure, accessible cloud location.",
    "size": 45,
    "reviews": 850,
    "ratingAvg": 4.4,
    "downloads": 89000,
    "image": "https://i.pinimg.com/736x/47/11/3d/47113d8fcea2f0e8a143484d1c131551.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 35
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 130
      },
      {
        "name": "4 star",
        "count": 260
      },
      {
        "name": "5 star",
        "count": 365
      }
    ]
  },
  {
    "id": 21,
    "title": "TimeTrack: Study Timer",
    "companyName": "FocusApps",
    "description": "TimeTrack is the ultimate productivity application for students, meticulously designed to help users **track and optimize their study hours efficiently**. It goes beyond a simple timer by incorporating techniques like the Pomodoro method or customizable study intervals, helping users maintain deep focus and prevent burnout. The app generates detailed reports on time allocation per subject, allowing students to identify distractions, understand their peak focus periods, and fine-tune their study plan for maximum effectiveness. Its light file size and simple interface make it an easy addition to any study routine. With **54,000 downloads** and 520 reviews, TimeTrack holds an average rating of **4.2**, proving its value as a practical tool for mastering the critical skill of time management and maximizing every study session.",
    "size": 33,
    "reviews": 520,
    "ratingAvg": 4.2,
    "downloads": 54000,
    "image": "https://i.pinimg.com/736x/63/01/e9/6301e96647509e0e6903f42925f8c4d1.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 25
      },
      {
        "name": "2 star",
        "count": 45
      },
      {
        "name": "3 star",
        "count": 110
      },
      {
        "name": "4 star",
        "count": 160
      },
      {
        "name": "5 star",
        "count": 180
      }
    ]
  },
  {
    "id": 22,
    "title": "MarkMate: Grade Easy",
    "companyName": "EduCore",
    "description": "MarkMate is a specialized administrative application built for educators to **simplify exam marking with automation tools**. This innovative platform uses smart technology to significantly reduce the manual effort and time involved in grading assignments, quizzes, and exams. It supports automated scoring for multiple-choice questions and provides efficient digital tools for rubric-based grading of subjective answers, ensuring consistency and fairness in the assessment process. The resulting data is instantly organized and available for analysis. With **99,000 downloads** and 940 reviews, MarkMate has earned an excellent average rating of **4.6**, making it a highly valued tool by teaching staff. It is the go-to solution for speeding up the grading process while maintaining accuracy and professionalism in academic evaluation.",
    "size": 42,
    "reviews": 940,
    "ratingAvg": 4.6,
    "downloads": 99000,
    "image": "https://i.pinimg.com/1200x/72/84/40/72844043828bb4f3454a9ef22b4777b4.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 35
      },
      {
        "name": "2 star",
        "count": 50
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 270
      },
      {
        "name": "5 star",
        "count": 465
      }
    ]
  },
  {
    "id": 23,
    "title": "PrepNow: Admission Aid",
    "companyName": "Udvash Systems",
    "description": "PrepNow is a powerhouse preparation application dedicated to helping students **prepare for university admission tests efficiently**. The platform offers a comprehensive curriculum specifically tailored to the requirements of various university entrance exams, featuring thousands of practice tests, mock exams, subject-specific tutorials, and high-yield review materials. Its integrated performance analytics allow students to pinpoint their weakest areas for targeted study and track their readiness over time. The app's commitment to test-specific content and rigorous practice makes it an essential tool for competitive success. Its immense popularity is clear from **250,000 downloads** and 2000 reviews, solidifying its top-tier status with an exceptional average rating of **4.8**. PrepNow is the definitive digital guide for ambitious students aiming for admission to their dream university.",
    "size": 50,
    "reviews": 2000,
    "ratingAvg": 4.8,
    "downloads": 250000,
    "image": "https://i.pinimg.com/736x/27/6c/a8/276ca8851284fce9e0af6bab2ddfa551.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 70
      },
      {
        "name": "2 star",
        "count": 90
      },
      {
        "name": "3 star",
        "count": 190
      },
      {
        "name": "4 star",
        "count": 520
      },
      {
        "name": "5 star",
        "count": 1130
      }
    ]
  },
  {
    "id": 24,
    "title": "EduChat: Ask Doubts",
    "companyName": "BrightTech",
    "description": "EduChat is a dynamic, interactive learning platform centered on **chat-based learning and doubt-solving with teachers**. This application bridges the communication gap between students and qualified educators, offering a direct, text-based channel for asking questions and receiving personalized academic support in real-time. Students can get instant clarification on homework problems, concept confusion, or study strategies without the formality of a full lecture or tutoring session. This accessible model makes help available right when a student needs it most. With **80,000 downloads** and 870 reviews, EduChat holds a respectable average rating of **4.3**, demonstrating its effectiveness as a quick and reliable source of academic assistance. It's the perfect solution for continuous, low-friction learning support.",
    "size": 38,
    "reviews": 870,
    "ratingAvg": 4.3,
    "downloads": 80000,
    "image": "https://i.pinimg.com/736x/03/32/20/0332209fec83c79d50af34c3b77d900e.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 40
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 150
      },
      {
        "name": "4 star",
        "count": 250
      },
      {
        "name": "5 star",
        "count": 370
      }
    ]
  },
  {
    "id": 25,
    "title": "StudySync: Learn Together",
    "companyName": "Learnify Ltd",
    "description": "StudySync is a collaborative and community-driven application, functioning as a peer-to-peer **collaborative learning app for group studies**. The platform facilitates the creation of virtual study groups, allowing students to connect with peers to discuss complex topics, share notes, work on joint projects, and quiz each other in a supportive environment. The core benefit of StudySync is harnessing the power of collective knowledge, turning solitary studying into a more engaging and effective social activity. With **105,000 downloads** and 980 reviews, the app has achieved a solid average rating of **4.5**. StudySync is vital for students who thrive in a group setting, providing all the necessary tools for seamless remote collaboration and enhancing the quality of shared educational efforts.",
    "size": 46,
    "reviews": 980,
    "ratingAvg": 4.5,
    "downloads": 105000,
    "image": "https://i.pinimg.com/1200x/c8/c5/e4/c8c5e4549e71ddac2152fcdd9b8a5218.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 45
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 140
      },
      {
        "name": "4 star",
        "count": 290
      },
      {
        "name": "5 star",
        "count": 445
      }
    ]
  },
  {
    "id": 26,
    "title": "FormEase: Smart Forms",
    "companyName": "DataLogic",
    "description": "FormEase is an essential utility for streamlining administrative tasks, designed to help institutions **create and manage digital forms efficiently**. This application moves beyond simple data collection by offering smart features such as conditional logic, secure data encryption, and integrated analytics for instant summary reporting. It's perfect for handling student registrations, feedback surveys, internal administrative processes, and parent communications. By digitizing and automating the form lifecycle, FormEase drastically reduces paper usage and manual data entry errors. With **67,000 downloads** and 720 reviews, the app maintains a solid average rating of **4.4**, proving its effectiveness in modernizing institutional operations. FormEase is the reliable, smart solution for all digital form creation and data management needs in education.",
    "size": 40,
    "reviews": 720,
    "ratingAvg": 4.4,
    "downloads": 67000,
    "image": "https://i.pinimg.com/736x/ac/06/06/ac060606299a09333364a36c29e57ccf.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 30
      },
      {
        "name": "2 star",
        "count": 50
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 210
      },
      {
        "name": "5 star",
        "count": 310
      }
    ]
  },
  {
    "id": 27,
    "title": "Graphix: Design Easy",
    "companyName": "Udvash Creatives",
    "description": "Graphix is an intuitive and user-friendly design tool for students and educators focused on creating **simple design tools for educational graphics**. The application simplifies the process of developing visual aids such as charts, diagrams, infographics, and presentation slides. Its library of academic templates and easy-to-use editing tools allows non-designers to create professional-looking content that enhances learning materials and classroom presentations. This visual enhancement helps in better conveying complex information. With **123,000 downloads** and 1300 reviews, Graphix boasts an excellent average rating of **4.6**. It's the indispensable tool for anyone in the educational field looking to elevate their content with high-quality visuals without needing specialized design software or extensive technical skills.",
    "size": 55,
    "reviews": 1300,
    "ratingAvg": 4.6,
    "downloads": 123000,
    "image": "https://i.pinimg.com/736x/3e/7c/0a/3e7c0a0547e28409c5a5c6b7f4a1980c.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 50
      },
      {
        "name": "2 star",
        "count": 60
      },
      {
        "name": "3 star",
        "count": 150
      },
      {
        "name": "4 star",
        "count": 360
      },
      {
        "name": "5 star",
        "count": 680
      }
    ]
  },
  {
    "id": 28,
    "title": "DocScan: Easy Scanning",
    "companyName": "SoftEdge",
    "description": "DocScan is a highly practical mobile application that enables users to **scan and organize academic documents instantly**. It transforms a smartphone camera into a high-quality scanner, allowing students and teachers to digitize lecture notes, textbook pages, assignments, and important handouts on the go. The app features intelligent cropping, text enhancement, and multi-page document creation, ensuring that the digital copies are clear and easy to read. Furthermore, its organizational features allow users to tag, categorize, and save documents to the cloud for secure access. With **76,000 downloads** and 800 reviews, DocScan maintains a strong average rating of **4.5**, making it a reliable, essential utility for managing and preserving physical academic papers in a convenient digital format.",
    "size": 37,
    "reviews": 800,
    "ratingAvg": 4.5,
    "downloads": 76000,
    "image": "https://i.pinimg.com/1200x/dc/98/67/dc986789f8da58837b9544c40a95d646.jpg",
    "ratings": [
      {
        "name": "1 star",
        "count": 35
      },
      {
        "name": "2 star",
        "count": 50
      },
      {
        "name": "3 star",
        "count": 120
      },
      {
        "name": "4 star",
        "count": 240
      },
      {
        "name": "5 star",
        "count": 355
      }
    ]
  }
]